config.org
#+title: Doom Emacs configuration

* Appearance
** Text
Set the desired font for Doom. The line height originates from the recommended settings from [[https://www.jetbrains.com/lp/mono/][the JetBrains Mono page]].

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "JetBrainsMono Nerd Font" :size 12.0 :weight 'medium)
     doom-variable-pitch-font (font-spec :family "SF Pro Display" :size 13.0 :weight 'medium)
     line-spacing 1.11)
#+end_src

*** Custom fonts
**** Org-mode
Catppuccin makes the heading rainbow-coloured for some reason. It also sets a few other fonts to a purplish shade of white, which doesn't work as well with OLEDPuccin. Set them all back to white instead.
#+begin_src emacs-lisp
(after! org
  (custom-set-faces!
              '(org-level-1 :foreground "#ffffff" :height 1.4 :weight bold)
              '(org-level-2 :foreground "#ffffff" :height 1.2 :weight bold)
              '(org-level-3 :foreground "#ffffff" :height 1.1 :weight bold)
              '(org-level-4 :foreground "#ffffff" :height 1.0 :weight bold)
              '(org-level-5 :foreground "#ffffff" :height 0.9 :weight bold)
              '(org-document-title :height 2.0 :foreground "#ffffff" :weight heavy)
              '(org-time-grid :foreground "#ffffff")))
#+end_src

Set the colour for Org-mode blocks' beginning and ending lines to a lighter grey, to create a visual distinction that indicates where these blocks begin and end. This is visually bothersome if Org-modern fringes are enabled, however, so disable it if it is turned on.
#+begin_src emacs-lisp
(after! org
  (custom-set-faces!
    '(org-block :background "#000000")
              '(org-block-begin-line :background "#000000" :foregorund "#eeeeee")
              '(org-block-end-line :background "#000000" :foregorund "#eeeeee")))
#+end_src

** Catppuccin theme
Catppuccin is a nice coloursheme, but the default background colour feels too jarring. I reckon OLEDPuccin would make for a more sleek appearance.

#+begin_src emacs-lisp
(setq doom-theme 'catppuccin)
(load-theme 'catppuccin t t)
(catppuccin-set-color 'base "#000000")
(catppuccin-set-color 'mantle "#0f0f0f")
(catppuccin-set-color 'crust "#1f1f1f")
(catppuccin-set-color 'text "#ffffff")
(catppuccin-reload)
#+end_src

** Line numbering
Set the line numbering to =relative= for easy Vim motions.

#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src

** Mixed pitch
#+begin_src emacs-lisp
(use-package mixed-pitch
  :hook
  ;; You might want to enable it only in org-mode or both text-mode and org-mode
  ((org-mode) . mixed-pitch-mode)
  :config
  (setq mixed-pitch-fixed-pitch-faces
        (append mixed-pitch-fixed-pitch-faces
                '(org-table
                  org-code
                  org-block
                  org-block-begin-line
                  org-block-end-line
                  org-meta-line
                  org-document-info-keyword
                  org-tag
                  org-time-grid
                  org-todo
                  org-done
                  org-agenda-date
                  org-date
                  org-drawer
                  org-modern-tag
                  org-modern-done
                  org-modern-label
                  org-scheduled
                  org-scheduled-today
                  neo-file-link-face
                  org-scheduled-previously)))
  (add-hook 'mixed-pitch-mode-hook #'solaire-mode-reset))
#+end_src

** Dashboard
Customise the ASCII art on the Doom dashboard. This one originates from NVChad, I believe.

#+begin_src emacs-lisp
(defun dysthesis/dashboard-setup ()
  (let* ((banner '("                                   "
	           "                                   "
	           "                                   "
	           "   ⣴⣶⣤⡤⠦⣤⣀⣤⠆     ⣈⣭⣿⣶⣿⣦⣼⣆          "
	           "    ⠉⠻⢿⣿⠿⣿⣿⣶⣦⠤⠄⡠⢾⣿⣿⡿⠋⠉⠉⠻⣿⣿⡛⣦       "
	           "          ⠈⢿⣿⣟⠦ ⣾⣿⣿⣷    ⠻⠿⢿⣿⣧⣄     "
	           "           ⣸⣿⣿⢧ ⢻⠻⣿⣿⣷⣄⣀⠄⠢⣀⡀⠈⠙⠿⠄    "
	           "          ⢠⣿⣿⣿⠈    ⣻⣿⣿⣿⣿⣿⣿⣿⣛⣳⣤⣀⣀   "
	           "   ⢠⣧⣶⣥⡤⢄ ⣸⣿⣿⠘  ⢀⣴⣿⣿⡿⠛⣿⣿⣧⠈⢿⠿⠟⠛⠻⠿⠄  "
	           "  ⣰⣿⣿⠛⠻⣿⣿⡦⢹⣿⣷   ⢊⣿⣿⡏  ⢸⣿⣿⡇ ⢀⣠⣄⣾⠄   "
	           " ⣠⣿⠿⠛ ⢀⣿⣿⣷⠘⢿⣿⣦⡀ ⢸⢿⣿⣿⣄ ⣸⣿⣿⡇⣪⣿⡿⠿⣿⣷⡄  "
	           " ⠙⠃   ⣼⣿⡟  ⠈⠻⣿⣿⣦⣌⡇⠻⣿⣿⣷⣿⣿⣿ ⣿⣿⡇ ⠛⠻⢷⣄ "
	           "      ⢻⣿⣿⣄   ⠈⠻⣿⣿⣿⣷⣿⣿⣿⣿⣿⡟ ⠫⢿⣿⡆     "
	           "       ⠻⣿⣿⣿⣿⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⡟⢀⣀⣤⣾⡿⠃     "
	           "                                   "))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'dysthesis/dashboard-setup)
#+end_src

* Org-mode
Tell Emacs where our Org-mode documents are stored.
#+begin_src emacs-lisp
(setq org-directory "~/Org/")
#+end_src

The default three-dots (=...=) icons doesn't really look that great, so change it to an arrow symbol instead.
#+begin_src emacs-lisp
(after! org
  (setq org-ellipsis " ↪"))
#+end_src

Show entities as UTF-8 characters.
#+begin_src emacs-lisp
(setq org-pretty-entities t)
#+end_src

** Archiving
Tell Emacs where entries should be archived to.
#+begin_src emacs-lisp
(setq org-archive-location "~/Org/archive.org::* From =%s=")
#+end_src

Create a macro for archiving all completed tasks.
#+begin_src emacs-lisp
(defun dysthesis/org-archive-done-tasks ()
  "Archive all done tasks."
  (interactive)
  (org-map-entries 'org-archive-subtree "/DONE" 'file))
#+end_src

** Refiling
Refiling means moving an Org-mode entry from one file to another. This is useful for quickly capturing entries to an inbox file, allowing for them to be organised later rather than now.

Tell Emacs which files Org-mode entries can be refiled to. This is used in conjunction with the GTD module.
#+begin_src emacs-lisp
(after! org
  (setq org-refile-targets '(("~/Org/GTD/gtd.org" :maxlevel . 2)
                           ("~/Org/GTD/someday.org" :level . 2)
                           ("~/Org/GTD/tickler.org" :maxlevel . 2)
                           ("~/Org/GTD/routine.org" :maxlevel . 2)
                           ("~/Org/GTD/reading.org" :maxlevel . 2))))
#+end_src

** Org-agenda
This (as well as Org-babel, of course) is perhaps the key feature of Org-mode that truly makes it worth the jump from, say, Obsidian. Markdown was not designed for task management, but Org is.

*** Basic setup
Configure a few basic variables for Org-agenda. This must be wrapped inside an =(after! org-agenda)= block to ensure that it does not get overwritten by Doom's default.

#+begin_src emacs-lisp :noweb yes
(after! org-agenda
  <<agenda-starts-today>>
  <<agenda-hide-completed-tasks>>
  <<agenda-show-deadlines>>
  <<agenda-hide-block-separator>>)
#+end_src

**** Do not show past dates in the time grid
By default, Org-agenda displays the past three days on the time-grid, as well as the next three days. The agenda is for planning, not for reflection and whatnot (at least, I don't use it that way). Therefore, set it to only display future dates.

#+name:agenda-starts-today
#+begin_src emacs-lisp :tangle no :noweb yes
(setq org-agenda-start-day "0d")
#+end_src

Here, =0d= means that Org-agenda will start the time-grid from today. To tell Org-agenda to start from yesterday, for example, set it to =-1d=, or set it to =1d= to start from tomorrow.

**** Do not show tasks if completed
By default, Org-agenda displays tasks even if they are completed. It is unnecessary, therefore, it should be disabled

#+name: agenda-hide-completed-tasks
#+begin_src emacs-lisp :tangle no :noweb yes
(setq org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t)
#+end_src

**** Show deadlines
I reckon this should be on by default, I have no idea why it isn't. It is important to be able to see deadlines of tasks in the agenda view, therefore, enable it.

#+name: agenda-show-deadlines
#+begin_src emacs-lisp :tangle no :noweb yes
(setq org-agenda-include-deadlines t)
#+end_src

**** Hide block separators
Block separators tend to be nothing more than visual clutter for me, therefore, disable it.

#+name:agenda-hide-block-separator
#+begin_src emacs-lisp :tangle no :noweb yes
(setq org-agenda-block-separator nil)
#+end_src

*** Agenda files
Set all Org files under =~/Org/GTD= as Org-agenda files.

#+begin_src emacs-lisp
(after! org
  (setq org-agenda-files (directory-files-recursively "~/Org/GTD/" "\\.org$")))
#+end_src

*** Keywords
Set the Org-agenda keyword sequence.

#+begin_src emacs-lisp
(after! org
  (setq org-todo-keywords
        '((sequence "TODO(t)" "NEXT(n)" "WAIT(w)" "PROG(p)" "|" "DONE(d)" "|" "CANCEL(c)"))))
#+end_src

*** Sorting strategy
Define how Org-agenda should sort agenda entries. Here, it should sort based on the following, listed in order of importance:

1. *Urgency*, in a descending order. Urgency is a score calculated by Emacs based on the priority and deadline of a task.
2. *Deadline,* in an ascending order (from earliest to latest).
3. *Priority,* in a descending order (from the most to least important).
4. *Effort,* in an ascending order (from lowest to highest effort).

   #+begin_src emacs-lisp
(after! org
  (setq org-agenda-sorting-strategy
        '((urgency-up deadline-up priority-down effort-up))))
   #+end_src

*** Habit visualiser
Add a diagram for visualising Org-agenda habits.

#+begin_src emacs-lisp
(add-to-list 'org-modules 'org-habit t)
#+end_src

*** GTD functions
Stolen from [[https://github.com/jethrokuan/dots/blob/master/.doom.d/config.el][Jethro Kuan's Emacs configuration]], and slightly modified. This section of the configuration is responsible for managing inbox items in an Org-agenda view. When you press =r= in an agenda view, it will start finding any inbox items and iterate through it, prompting you for tags, categories, timestamp, and refile targets. If the tag =someday= is *not* present, it will ask for a scheduled or deadline time too.

How this version differs from Jethro's original version:
- For some reason, the original =mark-inbox-todos= does not work, because =org-agenda-bulk-mark-regexp= does not behave as expected. Therefore, we iterate through each TODO item in the agenda and get their categories instead.

