config.org
*** Substitute keywords with symbols
It is also possible to substitute entire keywords instead of just block names. This is useful for making elements such as document metadatas (=#+title=, =#+property=, etc.) more visually pleasing.

#+begin_src emacs-lisp
(setq org-modern-keyword
 '((t . t)
   ("title" . "𝙏 ")
   ("filetags" . "󰓹 ")
   ("auto_tangle" . "󱋿 ")
   ("subtitle" . "𝙩 ")
   ("author" . "𝘼 ")
   ("email" . #(" " 0 1 (display (raise -0.14))))
   ("date" . "𝘿 ")
   ("property" . "☸ ")
   ("options" . "⌥ ")
   ("startup" . "⏻ ")
   ("macro" . "𝓜 ")
   ("bind" . #(" " 0 1 (display (raise -0.1))))
   ("bibliography" . " ")
   ("print_bibliography" . #(" " 0 1 (display (raise -0.1))))
   ("cite_export" . "⮭ ")
   ("print_glossary" . #("ᴬᶻ " 0 1 (display (raise -0.1))))
   ("glossary_sources" . #(" " 0 1 (display (raise -0.14))))
   ("include" . "⇤ ")
   ("setupfile" . "⇚ ")
   ("html_head" . "🅷 ")
   ("html" . "🅗 ")
   ("latex_class" . "🄻 ")
   ("latex_class_options" . #("🄻 " 1 2 (display (raise -0.14))))
   ("latex_header" . "🅻 ")
   ("latex_header_extra" . "🅻⁺ ")
   ("latex" . "🅛 ")
   ("beamer_theme" . "🄱 ")
   ("beamer_color_theme" . #("🄱 " 1 2 (display (raise -0.12))))
   ("beamer_font_theme" . "🄱𝐀 ")
   ("beamer_header" . "🅱 ")
   ("beamer" . "🅑 ")
   ("attr_latex" . "🄛 ")
   ("attr_html" . "🄗 ")
   ("attr_org" . "⒪ ")
   ("call" . #(" " 0 1 (display (raise -0.15))))
   ("name" . "⁍ ")
   ("header" . "› ")
   ("caption" . "☰ ")
   ("results" . "🠶")))
#+end_src
*** Org-agenda styling
Make the time-grid on Org-agenda views look nicer.
#+begin_src emacs-lisp
(setq org-agenda-tags-column 0
      org-agenda-block-separator ?─
      org-agenda-time-grid
      '((daily today require-timed)
        (800 1000 1200 1400 1600 1800 2000)
        " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
      org-agenda-current-time-string
      "⭠ now ─────────────────────────────────────────────────")
#+end_src

Give colour to TODO faces.

#+begin_src emacs-lisp
(setq org-modern-todo-faces
 '(("WAIT"
    :inverse-video t
    :inherit +org-todo-onhold)
   ("NEXT"
    :inverse-video t
    :foreground "#89b4fa")
   ("PROG"
    :inverse-video t
    :foreground "#a6e3a1")
   ("TODO"
    :inverse-video t
    :foreground "#fab387")))
#+end_src

*** Always-on Org-modern mode
Invoke the =global-org-modern-mode= to always enable this mode.

#+begin_src emacs-lisp
(global-org-modern-mode)
#+end_src

** Org-roam
*** General
Tell Org-roam where it should look for files. Here, =file-truename= is used to resolve symbolic links if any. It is not harmful to have it here even if symbolic links are not used.
#+begin_src emacs-lisp
(setq org-roam-directory (file-truename "~/Org/Roam"))
#+end_src

Start up Org-roam.
#+begin_src emacs-lisp :noweb yes
(use-package org-roam
  :ensure t
  :init
  (setq org-roam-v2-ack t)
  :custom
  <<org-roam-dailies>>
  :bind
  <<org-roam-keybinds>>
  :bind-keymap
  <<org-roam-dailies-keybinds>>
  :config
  <<org-roam-database-autosync>>
  <<org-roam-ensure-dailies>>
  <<org-roam-popup-rules>>
  <<org-roam-capture-templates>>)
#+end_src

*** Dailies
Org-roam-dailies is a part of Org-roam that allows for journalling. Define the capture template and where to store its files (relative to the Org-roam directory path).

#+name: org-roam-dailies
#+begin_src emacs-lisp :tangle no :noweb yes
(org-roam-dailies-capture-templates
    '(("d" "default" entry "* %<%H:%M> %?"
       :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
(org-roam-dailies-directory "Daily/")
#+end_src

Tell Org-roam to ensure that the dailies module is loaded on startup.
#+name: org-roam-ensure-dailies
#+begin_src emacs-lisp :tangle no :noweb yes
(require 'org-roam-dailies)
#+end_src

*** Keybinding
Define some basic Org-roam keybindings.
#+name:org-roam-keybinds
#+begin_src emacs-lisp :noweb yes :tangle no
(("C-c n l" . org-roam-buffer-toggle)
     ("C-c n f" . org-roam-node-find)
     ("C-c n i" . org-roam-node-insert)
     ("C-c i" . org-roam-node-insert)
     ("C-c n q" . org-roam-node-insert-immediate)
     ("C-c n t" . org-roam-tag-add)
     ("C-c n c" . org-roam-capture)
     ("C-c n a" . org-roam-alias-add)
     :map org-mode-map
     ("C-M-i"    . completion-at-point)
     :map org-roam-dailies-map
     ("y" . org-roam-dailies-capture-yesterday)
     ("t" . org-roam-dailies-capture-tomorrow))
#+end_src

Also define some basic Org-roam-dailies keybindings.
#+name: org-roam-dailies-keybinds
#+begin_src emacs-lisp :tangle no :noweb yes
("C-c n d" . org-roam-dailies-map)
#+end_src

*** Autosync database
Automatically keep the Org-roam database up to dateto maintain cache consistency.

#+name:org-roam-database-autosync
#+begin_src emacs-lisp :noweb yes :tangle no
(org-roam-db-autosync-mode)
#+end_src

*** Popup rules
Define some rules for the popup windows for Org-roam.

#+name:org-roam-popup-rules
#+begin_src emacs-lisp :noweb yes :tangle no
(set-popup-rules!
`((,(regexp-quote org-roam-buffer) ; persistent org-roam buffer
   :side right :width .33 :height .5 :ttl nil :modeline nil :quit nil :slot 1)
  ("^\\*org-roam: " ; node dedicated org-roam buffer
   :side right :width .33 :height .5 :ttl nil :modeline nil :quit nil :slot 2))))
#+end_src

*** Capture templates
Define templates for Org-roam capture. This is separate from the default Org-mode capture templates, and cannot be defined with DOCT, unfortunately.

#+name: org-roam-capture-templates
#+begin_src emacs-lisp :noweb yes :tangle no
(setq org-roam-capture-templates
      '(("d" " Default" plain
         "%?"
         :if-new (file+head "${slug}.org"
                            "#+title: ${title}\n#+filetags: :new:\n#+STARTUP: latexpreview")
         :immediate-finish t
         :unnarrowed t)
        ("i" "󰆼 Index note" plain
         "%?"
         :if-new (file+head "${slug}.org"
                            "#+title: ${title}\n#+filetags: :new:index:")
         :immediate-finish t
         :unarrowed t)
        ("e" "󰖟 Elfeed" plain
         "%?"
         :target (file+head "Elfeed/${slug}.org"
                            "#+title: ${title}\n#+filetags: :new:article:rss:\n#+STARTUP: latexpreview"
                            ;;"#+filetags: :article:rss:\n"
                            )
         :unnarrowed t)
        ("l" "󰙨 Literature note" plain
         "%?"
         :target
         (file+head
          "%(expand-file-name (or citar-org-roam-subdir \"\") org-roam-directory)/Literature/${citar-citekey}.org"
          "#+title: ${note-title}.\n#+filetags: :new:\n#+created: %U\n#+last_modified: %U\n#+STARTUP: latexpreview\n\n* Annotations\n:PROPERTIES:\n:Custom_ID: ${citar-citekey}\n:NOTER_DOCUMENT: ${citar-file}\n:NOTER_PAGE: \n:END:\n\n")
         :unnarrowed t)
        ("d" " Idea" plain "%?"
         :if-new
         (file+head "${slug}.org" "#+title: ${title}\n#+filetags: :idea:new:\n#+STARTUP: latexpreview\n")
         :immediate-finish t
         :unnarrowed t)))
#+end_src

*** Quick capture
Create a function to quickly insert a link to a nonexistent note without necessarily capturing into it immediately.

#+begin_src emacs-lisp
(defun org-roam-node-insert-immediate (arg &rest args)
  (interactive "P")
  (let ((args (cons arg args))
        (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                  '(:immediate-finish t)))))
    (apply #'org-roam-node-insert args)))
#+end_src

*** Modeline file name
#+begin_src emacs-lisp
(defadvice! doom-modeline--buffer-file-name-roam-aware-a (orig-fun)
  :around #'doom-modeline-buffer-file-name ; takes no args
  (if (s-contains-p org-roam-directory (or buffer-file-name ""))
      (replace-regexp-in-string
       "\\(?:^\\|.*/\\)\\([0-9]\\{4\\}\\)\\([0-9]\\{2\\}\\)\\([0-9]\\{2\\}\\)[0-9]*-"
       "🢔(\\1-\\2-\\3) "
       (subst-char-in-string ?_ ?  buffer-file-name))
    (funcall orig-fun)))
#+end_src

*** Graph view
#+begin_src emacs-lisp
(use-package! websocket
    :after org-roam)

(use-package! org-roam-ui
  :after org ;; or :after org
  ;;         normally we'd recommend hooking orui after org-roam, but since org-roam does not have
  ;;         a hookable mode anymore, you're advised to pick something yourself
  ;;         if you don't care about startup time, use
  ;;  :hook (after-init . org-roam-ui-mode)
  :config
  (setq org-roam-ui-sync-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t
        org-roam-ui-custom-theme
        '((bg-alt . "#0f0f0f")
          (bg . "#000000")
          (fg . "#ffffff")
          (fg-alt . "#cdd6f4")
          (red . "#f38ba8")
          (orange . "#fab387")
          (yellow ."#f9e2af")
          (green . "#a6e3a1")
          (cyan . "#94e2d5")
          (blue . "#89b4fa")
          (violet . "#8be9fd")
          (magenta . "#f5c2e7"))))
#+end_src
